In [1]:
from sqlalchemy.engine import create_engine
import pymysql
import pandas as pd
import json
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus
username = "root"
password = quote_plus("root") 
db_name = "books"
connection = f'mysql+pymysql://{username}:{password}@localhost/{db_name}'
engine = create_engine(connection)

In [2]:
q="""DESCRIBE authors;"""
pd.read_sql(q,engine)

         Field    Type Null  Key Default Extra
0        index  bigint  YES  MUL    None
1    idAuthors  bigint  YES         None
2  Author_name    text  YES         None

In [3]:
q="""DESCRIBE books;"""
pd.read_sql(q,engine)

        Field    Type Null  Key Default Extra
0       index  bigint  YES  MUL    None
1     idBooks  bigint  YES         None
2  book_title    text  YES         None
3   author_id  bigint  YES         None

In [4]:
q="""DESCRIBE favorites;"""
pd.read_sql(q,engine)

           Field    Type Null  Key Default Extra
0          index  bigint  YES  MUL    None
1  Users_User_id  bigint  YES         None
2  Books_idBooks  bigint  YES         None

In [5]:
q="""DESCRIBE users;"""
pd.read_sql(q,engine)

        Field    Type Null  Key Default Extra
0       index  bigint  YES  MUL    None
1     User_id  bigint  YES         None
2  First_name    text  YES         None
3   Last_name    text  YES         None
4       email    text  YES         None

In [6]:
df_users=pd.read_csv('C:/Users/Dell/Downloads/users  - users.csv')
df_favorites=pd.read_csv('C:/Users/Dell/Downloads/favorites - favorites.csv')
df_books=pd.read_csv('C:/Users/Dell/Downloads/books - books.csv')
df_authors=pd.read_csv('C:/Users/Dell/Downloads/authors - authors.csv')

In [7]:
df_users.columns.str.upper()

Index(['ID', 'FIRST_NAME', 'LAST_NAME', 'EMAIL'], dtype='object')

In [8]:
df_users.columns

Index(['id', 'first_name', 'last_name', 'email'], dtype='object')

In [9]:
df_favorites.columns

Index(['user_id', 'book_id'], dtype='object')

In [10]:
df_books.columns

Index(['id', 'title', 'author_id'], dtype='object')

In [11]:
df_authors.columns

Index(['id', 'author_name'], dtype='object')

In [12]:
rename_map = {"df_users":"users","df_favorites":"favorites","df_books":"books","df_authors":"authors"}
users = df_users.rename(rename_map,axis=1)
favorites = df_favorites.rename(rename_map,axis=1)
books = df_books.rename(rename_map,axis=1)
authors = df_authors.rename(rename_map,axis=1)

In [13]:
authors = authors.rename(columns={'id':'idAuthors','author_name':'Author_name'})
users = users.rename(columns={'id':'User_id', 'first_name':'First_name', 'last_name':'Last_name', 'email':'email'})
favorites = favorites.rename(columns={'user_id':'Users_User_id', 'book_id':'Books_idBooks'})
books = books.rename(columns={'id':'idBooks', 'title':'book_title', 'author_id':'author_id'})

In [14]:
engine.execute('TRUNCATE table favorites;')

In [15]:
favorites.to_sql('favorites',engine, if_exists='replace')

7

In [16]:
engine.execute('TRUNCATE table books;')

In [17]:
books.to_sql('books',engine, if_exists='replace')

6

In [18]:
engine.execute('TRUNCATE table authors;')

In [19]:
authors.to_sql('authors',engine, if_exists='replace')

5

In [20]:
engine.execute('TRUNCATE table users;')

In [21]:
users.to_sql('users',engine, if_exists='replace')

3

In [22]:
q="""DESCRIBE authors;"""
pd.read_sql(q,engine)

         Field    Type Null  Key Default Extra
0        index  bigint  YES  MUL    None
1    idAuthors  bigint  YES         None
2  Author_name    text  YES         None

In [23]:
q="""DESCRIBE users;"""
pd.read_sql(q,engine)

        Field    Type Null  Key Default Extra
0       index  bigint  YES  MUL    None
1     User_id  bigint  YES         None
2  First_name    text  YES         None
3   Last_name    text  YES         None
4       email    text  YES         None

In [24]:
q="""DESCRIBE books;"""
pd.read_sql(q,engine)

        Field    Type Null  Key Default Extra
0       index  bigint  YES  MUL    None
1     idBooks  bigint  YES         None
2  book_title    text  YES         None
3   author_id  bigint  YES         None

In [25]:
q="""DESCRIBE favorites;"""
pd.read_sql(q,engine)

           Field    Type Null  Key Default Extra
0          index  bigint  YES  MUL    None
1  Users_User_id  bigint  YES         None
2  Books_idBooks  bigint  YES         None

In [26]:
q="""SHOW TABLES;"""
pd.read_sql(q,engine)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

In [27]:
q="""SELECT books.book_title, favorites.Users_User_id
FROM books
JOIN favorites ON books.idBooks = favorites.Books_idBooks
WHERE favorites.Users_User_id = 
    (SELECT users.User_id FROM users WHERE (users.Last_name = "Doe" AND users.First_name = "John"));;"""
pd.read_sql(q,engine)

         book_title  Users_User_id
0       The Shining              1
1                It              1
2  The Great Gatsby              1